var imageData = {
    "三坊七巷": "图画/三坊七巷.png",
    "上下杭": "图画/上下杭.png",
    "乌塔": "图画/乌塔.png",
    "五一广场": "图画/五一广场.png",
    "古厝飞檐": "图画/古厝飞檐.png",
    "夜景": "图画/夜景.jpg",
    "州": "图画/州.png",
    "林则徐纪念馆": "图画/林则徐纪念馆.png",
    "流苏": "图画/流苏.jpg",
    "爱心树": "图画/爱心树.png",
    "白塔": "图画/白塔.png",
    "福": "图画/福.png",
    "红墙": "图画/红墙.jpg",
    "茉莉花": "图画/茉莉花.png",
    "茉莉花1": "图画/茉莉花1.png",
    "茉莉花2": "图画/茉莉花2.png",
    "西禅寺": "图画/西禅寺.png",
    "镇海楼": "图画/镇海楼.png",
    "马鞍墙": "图画/马鞍墙.png",
    "鱼丸": "图画/鱼丸.png"
};

var themeData = {
    "三坊七巷": ["爱心树", "林则徐纪念馆", "马鞍墙", "三坊七巷"],
    "福州特色": ["福", "古厝飞檐", "红墙", "流苏", "茉莉花", "鱼丸", "州"],
    "上下杭": ["上下杭", "夜景"],
    "西禅寺": ["西禅寺"],
    "地标建筑": ["白塔", "乌塔", "五一广场", "镇海楼"]
};

var themeColor = { 
    "三坊七巷": "#b35f2d",
    "福州特色": "#8fbc8f",
    "上下杭": "#5b7c5c",
    "西禅寺": "#b8865b",
    "地标建筑": "#4a6fa5" 
};
